# This file is a list of VS Code extensions installed on macOS.
# Refresh it with `code --list-extensions --show-versions`.
# Install entries with `code --install-extension <publisher.extension@version>`.

bierner.emojisense@0.10.0
bradlc.vscode-tailwindcss@0.14.29
codezombiech.gitignore@0.10.0
dakshmiglani.hex-to-rgba@1.0.0
davidanson.vscode-markdownlint@0.61.2
donjayamanne.githistory@0.6.20
github.vscode-github-actions@0.31.5
github.vscode-pull-request-github@0.144.0
golang.go@0.52.2
hashicorp.terraform@2.39.2
mechatroner.rainbow-csv@3.24.1
mohsen1.prettify-json@0.0.3
ms-python.debugpy@2026.6.0
ms-python.python@2026.4.0
ms-python.vscode-pylance@2026.2.1
ms-python.vscode-python-envs@1.30.0
ms-vscode.vscode-typescript-next@6.0.20260416
openai.chatgpt@26.506.31421
pkief.material-icon-theme@5.34.0
redhat.vscode-xml@0.29.2
redhat.vscode-yaml@1.23.0
rust-lang.rust-analyzer@0.3.2896
shopify.ruby-extensions-pack@0.1.14
shopify.ruby-lsp@0.10.3
unifiedjs.vscode-mdx@1.8.17
yzhang.markdown-all-in-one@3.6.3
